; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v4 ?v1)
             (pred_5 ?v7 ?v3)
             (pred_12 ?v4 ?v3)
             (pred_9 ?v5 ?v4 )
	     (pred_8 ?v4)
             (pred_2 ?v6)
             (pred_4 ?v7)
             (pred_6 ?v3)
             (pred_3 ?v4)
             (pred_1 ?v7)
             (pred_11 ?v4)
             (pred_7 ))



(:action op_2
:parameters (?v2 ?v13 ?v8 ?v9)
:precondition (and (pred_2 ?v2) (pred_2 ?v13) (pred_4 ?v8) (pred_6 ?v9)
          (pred_10 ?v2 ?v13) (pred_5 ?v8 ?v9)
                   (pred_12 ?v13 ?v9) (pred_8 ?v2) 
                   (pred_3 ?v13) (pred_1 ?v8))
:effect (and  (pred_11 ?v13) (not (pred_3 ?v13))))


(:action op_3
:parameters (?v2 ?v12)
:precondition (and (pred_2 ?v2) (pred_2 ?v12)
               (pred_8 ?v2) (pred_10 ?v2 ?v12) (pred_11 ?v12))
:effect (and (pred_8 ?v12) (not (pred_8 ?v2))))

(:action op_5
:parameters (?v2 ?v8)
:precondition (and (pred_2 ?v2) (pred_4 ?v8) 
                  (pred_8 ?v2) (pred_9 ?v8 ?v2) (pred_7 ))
:effect (and (pred_1 ?v8)
   (not (pred_9 ?v8 ?v2)) (not (pred_7 ))))


(:action op_4
:parameters (?v2 ?v11 ?v10)
:precondition (and (pred_2 ?v2) (pred_4 ?v11) (pred_4 ?v10)
                  (pred_8 ?v2) (pred_1 ?v10) (pred_9 ?v11 ?v2))
:effect (and (pred_1 ?v11) (pred_9 ?v10 ?v2)
        (not (pred_1 ?v10)) (not (pred_9 ?v11 ?v2))))

(:action op_1
:parameters (?v2 ?v8)
:precondition (and (pred_2 ?v2) (pred_4 ?v8) 
                  (pred_8 ?v2) (pred_1 ?v8))
:effect (and (pred_7 ) (pred_9 ?v8 ?v2) (not (pred_1 ?v8)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_02 obj_06 obj_27 obj_30 obj_25 obj_08 obj_22 obj_24 obj_20 obj_04 obj_14 obj_05 obj_17 obj_28 obj_01 obj_07 obj_29 obj_23 obj_10 obj_19 obj_21 obj_16 obj_11 obj_03 obj_26
    obj_09 obj_13
    obj_12 obj_15 obj_18
    )

    (:init
       (pred_7)

       (pred_2 obj_02)
       (pred_2 obj_06)
       (pred_2 obj_27)
       (pred_2 obj_30)
       (pred_2 obj_25)
       (pred_2 obj_08)
       (pred_2 obj_22)
       (pred_2 obj_24)
       (pred_2 obj_20)
       (pred_2 obj_04)
       (pred_2 obj_14)
       (pred_2 obj_05)
       (pred_2 obj_17)
       (pred_2 obj_28)
       (pred_2 obj_01)
       (pred_2 obj_07)
       (pred_2 obj_29)
       (pred_2 obj_23)
       (pred_2 obj_10)
       (pred_2 obj_19)
       (pred_2 obj_21)
       (pred_2 obj_16)
       (pred_2 obj_11)
       (pred_2 obj_03)
       (pred_2 obj_26)
       (pred_6 obj_09)
       (pred_6 obj_13)
       (pred_4 obj_12)
       (pred_4 obj_15)
       (pred_4 obj_18)

       (pred_10 obj_02 obj_08)
       (pred_10 obj_02 obj_06)
       (pred_10 obj_06 obj_22)
       (pred_10 obj_06 obj_27)
       (pred_10 obj_06 obj_02)
       (pred_10 obj_27 obj_24)
       (pred_10 obj_27 obj_30)
       (pred_10 obj_27 obj_06)
       (pred_10 obj_30 obj_20)
       (pred_10 obj_30 obj_25)
       (pred_10 obj_30 obj_27)
       (pred_10 obj_25 obj_04)
       (pred_10 obj_25 obj_30)
       (pred_10 obj_08 obj_14)
       (pred_10 obj_08 obj_22)
       (pred_10 obj_08 obj_02)
       (pred_10 obj_22 obj_05)
       (pred_10 obj_22 obj_24)
       (pred_10 obj_22 obj_06)
       (pred_10 obj_22 obj_08)
       (pred_10 obj_24 obj_17)
       (pred_10 obj_24 obj_20)
       (pred_10 obj_24 obj_27)
       (pred_10 obj_24 obj_22)
       (pred_10 obj_20 obj_28)
       (pred_10 obj_20 obj_04)
       (pred_10 obj_20 obj_30)
       (pred_10 obj_20 obj_24)
       (pred_10 obj_04 obj_01)
       (pred_10 obj_04 obj_25)
       (pred_10 obj_04 obj_20)
       (pred_10 obj_14 obj_07)
       (pred_10 obj_14 obj_05)
       (pred_10 obj_14 obj_08)
       (pred_10 obj_05 obj_29)
       (pred_10 obj_05 obj_17)
       (pred_10 obj_05 obj_22)
       (pred_10 obj_05 obj_14)
       (pred_10 obj_17 obj_23)
       (pred_10 obj_17 obj_28)
       (pred_10 obj_17 obj_24)
       (pred_10 obj_17 obj_05)
       (pred_10 obj_28 obj_10)
       (pred_10 obj_28 obj_01)
       (pred_10 obj_28 obj_20)
       (pred_10 obj_28 obj_17)
       (pred_10 obj_01 obj_19)
       (pred_10 obj_01 obj_04)
       (pred_10 obj_01 obj_28)
       (pred_10 obj_07 obj_21)
       (pred_10 obj_07 obj_29)
       (pred_10 obj_07 obj_14)
       (pred_10 obj_29 obj_16)
       (pred_10 obj_29 obj_23)
       (pred_10 obj_29 obj_05)
       (pred_10 obj_29 obj_07)
       (pred_10 obj_23 obj_11)
       (pred_10 obj_23 obj_10)
       (pred_10 obj_23 obj_17)
       (pred_10 obj_23 obj_29)
       (pred_10 obj_10 obj_03)
       (pred_10 obj_10 obj_19)
       (pred_10 obj_10 obj_28)
       (pred_10 obj_10 obj_23)
       (pred_10 obj_19 obj_26)
       (pred_10 obj_19 obj_01)
       (pred_10 obj_19 obj_10)
       (pred_10 obj_21 obj_16)
       (pred_10 obj_21 obj_07)
       (pred_10 obj_16 obj_11)
       (pred_10 obj_16 obj_29)
       (pred_10 obj_16 obj_21)
       (pred_10 obj_11 obj_03)
       (pred_10 obj_11 obj_23)
       (pred_10 obj_11 obj_16)
       (pred_10 obj_03 obj_26)
       (pred_10 obj_03 obj_10)
       (pred_10 obj_03 obj_11)
       (pred_10 obj_26 obj_19)
       (pred_10 obj_26 obj_03)
       (pred_3 obj_19)
       (pred_3 obj_07)
       (pred_3 obj_08)
       (pred_12  obj_19 obj_09)
       (pred_12  obj_07 obj_13)
       (pred_12  obj_08 obj_13)
       (pred_11 obj_02)
       (pred_11 obj_06)
       (pred_11 obj_27)
       (pred_11 obj_30)
       (pred_11 obj_25)
       (pred_11 obj_22)
       (pred_11 obj_24)
       (pred_11 obj_20)
       (pred_11 obj_04)
       (pred_11 obj_14)
       (pred_11 obj_05)
       (pred_11 obj_17)
       (pred_11 obj_28)
       (pred_11 obj_01)
       (pred_11 obj_29)
       (pred_11 obj_23)
       (pred_11 obj_10)
       (pred_11 obj_21)
       (pred_11 obj_16)
       (pred_11 obj_11)
       (pred_11 obj_03)
       (pred_11 obj_26)

       (pred_5  obj_12 obj_09)
       (pred_5  obj_15 obj_13)
       (pred_5  obj_18 obj_13)
       (pred_9 obj_12 obj_04)
       (pred_9 obj_15 obj_04)
       (pred_9 obj_18 obj_21)
       (pred_8 obj_27)
    )

    (:goal (and
       (pred_9 obj_12 obj_14)
       (pred_9 obj_15 obj_29)
       (pred_9 obj_18 obj_16)
    ))
(:constraints
  (always (not (pred_8 obj_24)))
)
)

; plan
1. (op_3 obj_27 obj_06)
   deleted: (pred_8 obj_27)
   added: (pred_8 obj_06)
   goals met: 0 of 3
2. (op_3 obj_06 obj_22)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_22)
   goals met: 0 of 3
3. (op_3 obj_22 obj_05)
   deleted: (pred_8 obj_22)
   added: (pred_8 obj_05)
   goals met: 0 of 3
4. (op_3 obj_05 obj_17)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_17)
   goals met: 0 of 3
5. (op_3 obj_17 obj_28)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_28)
   goals met: 0 of 3
6. (op_3 obj_28 obj_20)
   deleted: (pred_8 obj_28)
   added: (pred_8 obj_20)
   goals met: 0 of 3
7. (op_3 obj_20 obj_04)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_04)
   goals met: 0 of 3
8. (op_5 obj_04 obj_15)
   deleted: (pred_9 obj_15 obj_04) (pred_7)
   added: (pred_1 obj_15)
   goals met: 0 of 3
9. (op_3 obj_04 obj_20)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_20)
   goals met: 0 of 3
10. (op_1 obj_20 obj_15)
   deleted: (pred_1 obj_15)
   added: (pred_7) (pred_9 obj_15 obj_20)
   goals met: 0 of 3
11. (op_3 obj_20 obj_04)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_04)
   goals met: 0 of 3
12. (op_5 obj_04 obj_12)
   deleted: (pred_9 obj_12 obj_04) (pred_7)
   added: (pred_1 obj_12)
   goals met: 0 of 3
13. (op_3 obj_04 obj_20)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_20)
   goals met: 0 of 3
14. (op_3 obj_20 obj_28)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_28)
   goals met: 0 of 3
15. (op_3 obj_28 obj_17)
   deleted: (pred_8 obj_28)
   added: (pred_8 obj_17)
   goals met: 0 of 3
16. (op_3 obj_17 obj_05)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_05)
   goals met: 0 of 3
17. (op_3 obj_05 obj_14)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_14)
   goals met: 0 of 3
18. (op_1 obj_14 obj_12)
   deleted: (pred_1 obj_12)
   added: (pred_7) (pred_9 obj_12 obj_14)
   goals met: 1 of 3
19. (op_3 obj_14 obj_05)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_05)
   goals met: 1 of 3
20. (op_3 obj_05 obj_29)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_29)
   goals met: 1 of 3
21. (op_3 obj_29 obj_23)
   deleted: (pred_8 obj_29)
   added: (pred_8 obj_23)
   goals met: 1 of 3
22. (op_3 obj_23 obj_10)
   deleted: (pred_8 obj_23)
   added: (pred_8 obj_10)
   goals met: 1 of 3
23. (op_3 obj_10 obj_28)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_28)
   goals met: 1 of 3
24. (op_3 obj_28 obj_20)
   deleted: (pred_8 obj_28)
   added: (pred_8 obj_20)
   goals met: 1 of 3
25. (op_5 obj_20 obj_15)
   deleted: (pred_9 obj_15 obj_20) (pred_7)
   added: (pred_1 obj_15)
   goals met: 1 of 3
26. (op_3 obj_20 obj_28)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_28)
   goals met: 1 of 3
27. (op_3 obj_28 obj_10)
   deleted: (pred_8 obj_28)
   added: (pred_8 obj_10)
   goals met: 1 of 3
28. (op_3 obj_10 obj_23)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_23)
   goals met: 1 of 3
29. (op_3 obj_23 obj_29)
   deleted: (pred_8 obj_23)
   added: (pred_8 obj_29)
   goals met: 1 of 3
30. (op_1 obj_29 obj_15)
   deleted: (pred_1 obj_15)
   added: (pred_7) (pred_9 obj_15 obj_29)
   goals met: 2 of 3
31. (op_3 obj_29 obj_16)
   deleted: (pred_8 obj_29)
   added: (pred_8 obj_16)
   goals met: 2 of 3
32. (op_3 obj_16 obj_21)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_21)
   goals met: 2 of 3
33. (op_5 obj_21 obj_18)
   deleted: (pred_9 obj_18 obj_21) (pred_7)
   added: (pred_1 obj_18)
   goals met: 2 of 3
34. (op_3 obj_21 obj_16)
   deleted: (pred_8 obj_21)
   added: (pred_8 obj_16)
   goals met: 2 of 3
35. (op_1 obj_16 obj_18)
   deleted: (pred_1 obj_18)
   added: (pred_7) (pred_9 obj_18 obj_16)
   goals met: 3 of 3
